_posts/2013-02-19-Subclassing-an-ase.calculators.vasp-calculator-to-do-post-analysis.html
---
title: Subclassing an ase.calculators.vasp calculator to do post analysis
date: 2013/02/19 09:00:00
updated: 2013/03/01 14:54:24
categories: ase, VASP
---



<p>
Recently someone <a href="https://listserv.fysik.dtu.dk/pipermail/ase-users/2013-February/001683.html" >reported</a> on the ase-users mail list an issue they had with the Vasp calculator where the maximum number of electronic steps and then stops, even though the calculation is not converged. They asked how to make this raise an exception. This is not a built in feature in ase.calculators.vasp, but we can add it via a subclass. The idea is create a new class that inherits from ase.calculators.vasp, and then augment the calculate function to do some post analysis. In this case, we will parse the OUTCAR file looking for lines like:
</p>

<pre class="example">
----------------------------------------- Iteration    1(   1)  ---------------------------------------
</pre>

<p>
I think the first integer corresponds to an ionic iteration, while the number in parentheses corresponds to an electronic iteration.  We will just count them up, and see if they match the values we specified. If they do, we can print an error message, or raise an exception. Here is the code:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> ase.calculators.vasp <span style="color: #8b0000;">import</span> Vasp
<span style="color: #8b0000;">from</span> ase <span style="color: #8b0000;">import</span> Atom, Atoms
<span style="color: #8b0000;">import</span> os, re

os.chdir(<span style="color: #228b22;">'h2o-relax'</span>)

<span style="color: #8b0000;">class</span> <span style="color: #4682b4;">myvasp</span>(Vasp):
    <span style="color: #228b22;">'''subclass to run VASP and then check OUTCAR to see if the number</span>
<span style="color: #228b22;">    of electronic steps is equal to the max NELM specified, or if the</span>
<span style="color: #228b22;">    number of geometry steps is equal to NSW. Either case indicates</span>
<span style="color: #228b22;">    VASP may not be converged, but just stopped because it was told</span>
<span style="color: #228b22;">    too.'''</span>

    <span style="color: #ff0000; font-weight: bold;">#</span><span style="color: #ff0000; font-weight: bold;">save original function</span>
    
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">calculate</span>(<span style="color: #8b0000;">self</span>, *args):
        <span style="color: #228b22;">'Run VASP, then check if nsw or nelm is met'</span>

        <span style="color: #ff0000; font-weight: bold;">#</span><span style="color: #ff0000; font-weight: bold;">run original calculate method</span>
        Vasp.calculate(<span style="color: #8b0000;">self</span>, *args)
        
        <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">now do post analysis</span>
        NELM = <span style="color: #8b0000;">self</span>.int_params[<span style="color: #228b22;">'nelm'</span>]
        NSW = <span style="color: #8b0000;">self</span>.int_params[<span style="color: #228b22;">'nsw'</span>]

        max_nelm, max_nsw = 0, 0

        <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">open OUTCAR and check for what you want</span>
        <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">parse this line: - Iteration    1(   1)</span>
        regexp = re.compile(<span style="color: #228b22;">'Iteration\s+(?P&lt;nsw&gt;\d*)\(\s+(?P&lt;nelm&gt;\d*)\)'</span>)
        count = 0
        <span style="color: #8b0000;">with</span> <span style="color: #8b0000;">open</span>(<span style="color: #228b22;">'OUTCAR'</span>) <span style="color: #8b0000;">as</span> f:
            <span style="color: #8b0000;">for</span> line <span style="color: #8b0000;">in</span> f:
                <span style="color: #8b0000;">if</span> <span style="color: #228b22;">'Iteration'</span> <span style="color: #8b0000;">in</span> line:
                    m = regexp.search(line)
                    nsw = <span style="color: #8b0000;">int</span>(m.groupdict().get(<span style="color: #228b22;">'nsw'</span>))
                    <span style="color: #8b0000;">if</span> nsw &gt; max_nsw:
                        max_nsw = nsw
                    nelm = <span style="color: #8b0000;">int</span>(m.groupdict().get(<span style="color: #228b22;">'nelm'</span>))
                    <span style="color: #8b0000;">if</span> nelm &gt; max_nelm:
                        max_nelm = nelm

        <span style="color: #8b0000;">if</span> max_nelm == NELM:
            <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">raise exception here if you prefer</span>
            <span style="color: #8b0000;">print</span> (<span style="color: #228b22;">'{0} NELM steps taken! check convergence'</span>.format(max_nelm))
        <span style="color: #8b0000;">if</span> max_nsw == NSW:
            <span style="color: #8b0000;">print</span>(<span style="color: #228b22;">'{0} NSW steps taken! check convergence'</span>.format(max_nsw))


atoms = Atoms([Atom(<span style="color: #228b22;">'H'</span>, [0.5960812, -0.7677068, 0.0000000]),
               Atom(<span style="color: #228b22;">'O'</span>, [0.0000000, 0.0000000, 0.0000000]),
               Atom(<span style="color: #228b22;">'H'</span>, [0.5960812, 0.7677068, 0.0000000])],
               cell=(8, 8, 8))

calc = myvasp(xc=<span style="color: #228b22;">'PBE'</span>,
              nelm=2,
              encut=400,
              ismear=0,<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Gaussian smearing</span>
              ibrion=2,
              ediff=1e-8,
              nsw=3)

atoms.set_calculator(calc)

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Forces'</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'==========================='</span>
<span style="color: #8b0000;">print</span> atoms.get_forces()
</pre>
</div>

<pre class="example">
Forces
===========================
 running on    1 nodes
 distr:  one band on    1 nodes,    1 groups
 vasp.5.2.12 11Nov11 complex                                                    
  
 POSCAR found :  2 types and       3 ions
 LDA part: xc-table for Pade appr. of Perdew
 found WAVECAR, reading the header
 POSCAR, INCAR and KPOINTS ok, starting setup
 WARNING: small aliasing (wrap around) errors must be expected
 FFT: planning ...(           1 )
 reading WAVECAR
 the WAVECAR file was read sucessfully
 initial charge from wavefunction
 entering main loop
       N       E                     dE             d eps       ncg     rms          rms(c)
DAV:   1    -0.142298749169E+02   -0.14230E+02   -0.10298E-01    24   0.330E+00    0.231E-01
DAV:   2    -0.142281671566E+02    0.17078E-02   -0.36659E-03    24   0.581E-01
   1 F= -.14228167E+02 E0= -.14228167E+02  d E =-.142282E+02
 curvature:   0.00 expect dE= 0.000E+00 dE for cont linesearch  0.000E+00
 trial: gam= 0.00000 g(F)=  0.114E-04 g(S)=  0.000E+00 ort = 0.000E+00 (trialstep = 0.100E+01)
 search vector abs. value=  0.114E-04
 bond charge predicted
       N       E                     dE             d eps       ncg     rms          rms(c)
DAV:   1    -0.142273929196E+02    0.24820E-02   -0.17613E-03    24   0.419E-01    0.149E-02
DAV:   2    -0.142274190765E+02   -0.26157E-04   -0.20256E-04    16   0.115E-01
   2 F= -.14227419E+02 E0= -.14227419E+02  d E =0.748080E-03
 trial-energy change:    0.000748  1 .order   -0.000006   -0.000011   -0.000001
 step:   1.0700(harm=  1.0700)  dis= 0.00047  next Energy=   -14.228173 (dE=-0.609E-05)
 bond charge predicted
       N       E                     dE             d eps       ncg     rms          rms(c)
DAV:   1    -0.142274279955E+02   -0.35076E-04   -0.72088E-06    32   0.308E-02    0.758E-03
DAV:   2    -0.142274385490E+02   -0.10553E-04   -0.97783E-07    24   0.858E-03
   3 F= -.14227439E+02 E0= -.14227439E+02  d E =0.728608E-03
 curvature:  -0.53 expect dE=-0.133E-03 dE for cont linesearch -0.931E-08
 trial: gam=21.74088 g(F)=  0.248E-03 g(S)=  0.000E+00 ort = 0.445E-06 (trialstep = 0.204E-02)
 search vector abs. value=  0.565E-02
 writing wavefunctions
Running vanilla serial job
2 NELM steps taken! check convergence
3 NSW steps taken! check convergence
[[ 0.024 -0.028  0.   ]
 [-0.048  0.     0.   ]
 [ 0.024  0.028  0.   ]]
</pre>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/02/19/Subclassing-an-ase.calculators.vasp-calculator-to-do-post-analysis.org">org-mode source</a><p>
